tree = [1,           # корінь дерева рівень 0
         [2,           # рівень 1
           [4,           # рівень 2
             [8,           # рівень 3
               [14], [15]],   # рівень 4
             [9]],         # рівень 3
           [5,           # рівень 2
             [10], [11]]],  # рівень 3
         [3,           # рівень 1
           [6,           # рівень 2
             [12], [13]],  # рівень 3
           [7]]]         # рівень 2

# tree = [1,
#          [2,
#            [4,
#              [8,
#                [14], [15]
#              ],
#              [9]
#            ],
#            [5,
#              [10], [11]
#            ]
#          ],
#          [3,
#            [6,
#              [12], [13]
#            ],
#            [7]
#          ]
#         ]

if __name__ == "__main__":
    n = tree[1][2][2][0]  # Звернення до вузла
    print(n)
