

N = 7  # рядків сітки лабіринту
M = 7  # стовпчиків сітки лабіринту


def createMaze(N, M):
    maze = []  # Створення порожньої матриці для задавання лабіринту
    for i in range(N + 2):
        row = [0] * (M + 2)  # рядок матриці з M+2 елементів, що складається з 0
        maze.append(row)

    maze[1][1] = 1  # вільна клітина лабіринту
    maze[1][2] = 1  # вільна клітина лабіринту
    maze[1][3] = 1  # вільна клітина лабіринту
    maze[1][4] = 1
    maze[1][5] = 1
    maze[1][6] = 1
    maze[1][7] = 1
    maze[2][1] = 1
    maze[2][3] = 1
    maze[2][5] = 1
    maze[2][7] = 1
    maze[3][1] = 1
    maze[3][2] = 1
    maze[3][3] = 2  # стартова клітина лабіринту
    maze[3][5] = 1
    maze[3][6] = 1
    maze[3][7] = 1
    maze[4][1] = 1
    maze[4][7] = 1
    maze[5][1] = 1
    maze[5][2] = 1
    maze[5][3] = 1
    maze[5][5] = 1
    maze[5][6] = 1
    maze[5][7] = 1
    maze[6][3] = 1
    maze[6][7] = 1
    maze[7][1] = 1
    maze[7][2] = 1
    maze[7][3] = 1
    maze[7][4] = 1
    maze[7][5] = 1
    maze[7][7] = 3  # кінцева клітина лабіринту

    return maze


if __name__ == "__main__":
    maze = createMaze(N, M)