"""
Перестановки. Задача 2169 з е-олімп.
За заданим натуральним числом n вивести усі перестановки з цілих чисел від 1 до n у лексикографічному порядку.

Вхідні дані
Одне натуральне число n (1 ≤ n ≤ 8).

Вихідні дані
Вивести усі перестановки з цілих чисел від 1 до n у лексикографічному порядку. Кожну перестановку слід виводити в окремому рядку.

Висновок - пройшла на е-олімп 100%.
"""

def sequences(lst : list, n):
    """
    :param lst: підсписок перестановок
    :param n:   найбільший елемент послідовності
    :return:    None
    """
    k = len(lst)  # Визначаємо кількість членів поточної підпослідовності

    if k == n:    # Якщо всі елементи вже вичерпано
        print(*lst)
        return

    for i in range(1, n+1):
        if i not in lst:            # Якщо елемент i не міститься у підпослідовності
            lst_next = lst[:]       # Копіюємо список
            lst_next.append(i)      # Додаємо до нього елемент i
            sequences(lst_next, n)  # Запускаємо рекурсивно додавання інших членів послідовності.

# Головна програма
if __name__ == "__main__":
    n = int(input())
    lst = []
    sequences(lst, n)

