def bsearch_rightmost(array, x):
    """ Бінарний пошук для відшукання останнього входження заданого числа

    :param array: Відсортований за неспаданням масив цілих чисел
    :param x:     Шукане число
    :return:      Номер шуканого елемента у масиві
    """
    left = 0            # ліва границя пошуку
    right = len(array)  # права границя пошуку
    while left < right:
        m = left + (right - left) // 2  # Середина
        if array[m] <= x:
            left = m + 1
        else:
            right = m

    return left - 1


if __name__ == "__main__":
    a = [1, 2, 8, 8, 8, 8, 13, 13, 13, 13, 15, 15, 15, 15, 17, 17, 19, 20, 32, 42, 54, 92, 110, 222]
    i = [0, 1, 2, 3, 4, 5,  6,  7,  9,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21,  22,  23]
    print(bsearch_rightmost(a, 13))
