#!/usr/bin/env python
# -*- coding: utf-8 -*-

"""
Реалізуйте структуру даних зв'язний (однозв'язний) список з поточним елементом.
"""

def init():
    """ Викликається один раз на початку виконання програми. """
    pass


def empty():
    """ Перевіряє чи список порожній.

    :return: True, якщо список не містить жодного елемента
    """
    return True


def reset():
    """ Зробити поточний елемент першим.

    Переставляє поточний елемент на перший елемент списку
    """
    pass


def next():
    """ Перейти до наступного елемента.

    Перейти до наступного елемента – робить поточним елементом
    наступний елемент списку, що йде за поточним.
    Породжує виключення StopIteration, якщо наступний елемент порожній
    """
    pass


def current():
    """ Повертає навантаження поточного елементу.

    :return: Навантаження поточного елементу
    """
    return None


def insert_after(item):
    """ Вставляє новий елемент у список після поточного.

    :param item: елемент, що вставляється у список
    """
    pass


def insert_before(item):
    """ Вставляє новий елемент у список перед поточним.

    :param item: елемент, що вставляється у список
    """
    pass


def delete():
    """ Видаляє поточний елемент.

    Поточним при цьому стає наступний елемент, що йшов у списку після поточного.
    Якщо елемент, що видаляється був у списку останнім, то поточним стає передостанній елемент цього списку.
    """
    pass


def damp():
    """ Повертає масив у якому записані всі елементи поточного списку.

    :return: список list елементів списку
    """
    return []
