#!/usr/bin/env python
# -*- coding: utf-8 -*-

def init():
    """ Викликається 1 раз на початку виконання програми. """
    pass


def empty():
    """ Перевіряє чи список порожній

    :return: True, якщо список не містить жодного елемента
    """
    return True


def reset():
    """ Зробити поточний елемент першим."""
    pass


def next():
    """ Перейти до наступного елемента.

    Породжує виключення StopIteration, якщо наступний елемент порожній
    """
    pass


def current():
    """ Отримати поточний елемент

    :return: Навантаження поточного елементу
    """
    return None


def insert_after(item):
    """ Вставити новий елемент у список після поточного

    :param item: елемент, що вставляється у список
    """
    pass


def insert_before(item):
    """ Вставити новий елемент у список перед поточним

    :param item: елемент, що вставляється у список
    """
    pass


def delete():
    """ Видалити поточний елемент
    Поточним при цьому стає наступний елемент, що йшов у списку після потоного
    Якщо елемент, що видаляється був у списку останнім, то поточним стає передостанній елемент
    """
    pass


def damp():
    """ Повертає масив у якому записані всі елементи поточного списку.

    :return: список list елементів списку
    """
    return []
