"""
Реалізуйте алгоритм сортування злиттям.
"""

N = 1000000  # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000

# Sorting time:  23.765625

def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    # 1. якщо масив складається з одного елементу
    #    або порожній, то він відсортований
    if len(array) <= 1:
        return
    # 2. розбиваємо масив на дві половини і здійснюємо
    #    рекурсивний вклик сортування для кожної половини.
    m = len(array) // 2
    left = array[:m]
    right = array[m:]
    sort(left)
    sort(right)
    # 3. зливаємо дві відсортовані половини у один
    #    відсортований масив
    i = 0
    j = 0
    k = 0
    while i < len(left) and j < len(right):
        if left[i] < right[j]:
            array[k] = left[i]
            i += 1
        else:
            array[k] = right[j]
            j += 1
        k += 1

    while i < len(left):  # якщо залишилися елементи
                          # у лівому масиві
        array[k] = left[i]
        i += 1
        k += 1

    while j < len(right): # якщо залишилися елементи
                          # у правому масиві
        array[k] = right[j]
        j += 1
        k += 1








#


