"""
Реалізуйте алгоритм пошуку номеру останнього входження до заданого масиву заданого числа x.
Якщо заданий елемент відсутній у списку - поверніть номер останнього елементу, що менший за число x.
                            array[i] <= x
"""


def bsearch_rightmost(array, x):
    """ Бінарний пошук для відшукання останнього входження заданого числа

    :param array: Відсортований за неспаданням масив цілих чисел
    :param x:     Шукане число
    :return:      Номер шуканого елемента у масиві
    """
    # TODO: реалізуйте алгоритм тут
    return -1

