"""
Реалізуйте алгоритм пошуку номеру найпершого входження до заданого масиву, заданого числа x.
Якщо заданий елемент відсутній у списку - поверніть номер першого елементу, що більший за число x:
                            array[i] >= x
"""


def bsearch_leftmost(array, x):
    """ Бінарний пошук для відшукання найпершого входження заданого числа

    :param array: Відсортований за неспаданням масив цілих чисел
    :param x:     Шукане число
    :return:      Номер шуканого елемента у масиві
    """
    left = 0
    right = len(array)
    while left < right:
        m = left + (right - left) // 2
        curr = array[m]
        if curr >= x:
            right = m
        else:
            left = m + 1
    # print(array)

#  3   4   4   6   6   6   6   6   6   6   6   6   6   6   7   8   9  11  12  13  14  16  19  20  22  23
#  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21  22  23  24  25 26

    return left
