
"""
Реалізуйте алгоритм сортування вибором.
"""

N = 10000    # Кількість елементів масиву.
             # Використовується у головній програмі для генерування масиву з випадкових чисел
             # Для повільних алгоритмів сортування з асимптотикою n**2 рекомендується
             # використовувати значення не більше 10к
             # Для швидких алгоритмів сортування з асимптотикою
             # nlog(n) встановіть значення 1 000 000


def sort(array):
    """ Сортування масиву
    :param array: Вхідний масив даних, що треба відсортувати.
    """
    n = len(array)
    for edge in range(n - 1, 0, -1):
        max_pos = 0
        for i in range(1, edge + 1):
            if array[i] > array[max_pos]:
                max_pos = i

        array[edge], array[max_pos] = array[max_pos], array[edge]


if __name__ == '__main__':
    a = [6, 11, 4, 13, 7]
    sort(a)
    print(a)



